// Напишите программу,которая на вход принимает число и выдает является ли это число четным (делится ли оно на 2 без остатка)
//4-> да
//-3-> нет
//7-> нет

 Console.WriteLine("введите число: ");

 int a=Convert.ToInt32 (Console.ReadLine());

            if (a % 2==1)
            {
                Console.WriteLine("число нечетное");
            }
            if (a % 2==0)
            {
                Console.WriteLine("Число четное");

            }
                    
        